项目:
	销售人员 接到项目（网上，关系）
	需求人员（售前经理）: 谈客户需求（客户想要什么）--》需求文档   开发环境php mysql apache thinkphp版本 
																							 要把客户的中心内容描述清楚，描述客户的需求的具体详细内容。
	
	概要设计、详细设计  出数据字典（数据库设计的描述）  流程图（业务数据走向图）   
	
	程序员:  编码阶段 
	
	测试、运行、维护  测试和维护文档
	
后台内容	
模块划分: 核心
	会员模块（完）  商品类型(完)  出版社管理(完)    商品管理（书籍）(完)    	
辅助模块：
	公告模块，友情链接 ，订单
	
商品类型管理：
	任何内容管理 : 添加  删除 修改 列表（分页）;

前台 
	商品的展示(完)  
	购物车	
	删除购物车中的商品  /bId/ think_car 表中删除 不能从 think_books中删除
	再删除的时候需要 session 临时客户编号写到条件中。
	结算的时候需要登录。
	
支付宝:
	一 什么是支付宝
	二 支付宝实现流程以及原理
	三 支付宝接口怎么配置的。
	
	一 什么是支付宝
		支付宝是第三方提供的代收款的一个平台。
		支付宝、财付通、epay
	二 支付宝实现流程以及原理
		1 流程:
			
		
辅助模块：
	公告模块，友情链接 ，订单
		公告模块 友情链接  		标题  内容  图片	
		订单:   think_order    oId  oNum订单号   uId   oState订单状态
		
	
	
	
作业:
	 类型管理中的子类型管理  删除 修改  
	 出版社删除 修改
	 图书 删除  修改 分页。
	
	
	
	
	
	
	
	
	
	
	
																							