知识点：
	一 js遍历对象
	二js对象的内存分布
	三 对象的封装特性
	四 js  object对象
	
	
一 js遍历对象
	js 对象 包含属性和方法
	1 属性访问：
		对象.属性名称/方法名称
		对象["属性"]；  //类似于数组
		注意：
			js 数组和对象的概念比较模糊 ****;
			for..in
二js对象的内存分布 图

三 对象的封装特性
	封装：内用被隐藏，只保留调用或接口 与外部发生联系。
	1.通过在函数内部创建对象来封装
	2.直接编写封装成类。
	3.用prototype为类添加成员。
	
四 js  object对象 
	js自带的对象，所有js类的根类
	var obj = new Object();
	1.prototype 引用该对象的原型。用来添加属性和方法。
	2.instanceof  判断某个对象是否是某个类的对象。
		typeof fun1  // fun1 是不是对象。 说不明白fun1是谁的对象。
		注意：判断对象是否是类的实例。*****

注意：
	企业：面向对象，面试。 记忆

作业：
	demo8中 的所有的代码 3次。
	
		






	
	
			
	