<?php

echo "<br /><br />------------------------------流程控制语法，逻辑表达式 1 --------------------------<br /><br />";

$a = "阴天";

if ($a == "晴天") {

	echo "爬山";

} else if ($a == "下雨" ) {

	echo "带伞，";
	echo "收衣服";

} else if ($a == "刮风") {

	echo "关窗户，";
	echo "出门戴口罩";

} else {

	echo "睡大觉！";

}

echo "<br />------------------------------流程控制语法，逻辑表达式  2 --------------------------<br /><br />";

/*
    逻辑运算符：           大于  > 小于 < 等于 ==  不等于 !=
                         大于等于 >=  小于等于 <=
*/


$a = 10;
$b = 10;

if( $a > $b ){
	echo "a 的值大于 b";
}else if( $a < $b ){
	echo "a 的值小于 b";
}else if( $a == $b ){
	echo "a 的值等于 b";
}


echo "<br />------------------------------ 函数的使用  1 --------------------------<br /><br />";

function func1(){
	echo "函数只有调用才会执行<br />";
	echo "我是函数的第二条语句<br /><br />";
}

// 调用函数
func1();

echo "<br />------------------------------ 函数的使用  2 --------------------------<br /><br />";
function func2($a,$b){
	$c = $a + $b;
	return $c;
}

// 调用带参数的函数

$d = func2(5, 15);
echo "变量 $d 被赋予了 函数func2 的返回值： " . $d;


?>