<?php
header("content-type:text/html;charset=utf-8");
$arr = array(3, 6, 14, 7, 2, 20, 35); // 0--2 位置上的元素换位

$tmp = $arr[0]; 
$arr[0] = $arr[2];
$arr[2] = $tmp;

print_r($arr);

echo "<br />-----------冒泡排序---------------------<br />";
//方法：用第一个数字和后面所有的数字比较，冒出一个最大值
$brr = array(3, 6, 14, 7, 2, 20, 35);
print_r($brr);echo "<hr />";
for ($i = 0; $i < count($brr); $i++) {              //遍历 $brr
    //i = 0,1
    //j = 1,2
    for ($j = $i + 1; $j < count($brr); $j++) {     // 遍历比较 从当前数字后面开始比较。
        
        if ($brr[$i] < $brr[$j]) {                  // 判断 & 换位
            
            $tmps = $brr[$i];
            $brr[$i] = $brr[$j];
            $brr[$j] = $tmps;
        }
        print_r($brr); //可看到处理结果。  外层循环每循环1此，获得冒出一个最大值。
        echo "<br />";
    }
}
/*  过程推演：（i,j值及数组变化）
 * $brr = array(3, 6, 14, 7, 2, 20, 35);
 * i=0,j=1
 * $brr = array(6, 3, 14, 7, 2, 20, 35);
 * i=0,j=2
 * $brr = array(14, 3, 6, 7, 2, 20, 35);
 * i=0,j=3
 * $brr = array(14, 3, 6, 7, 2, 20, 35);
 * i=0,j=4
 * $brr = array(14, 3, 6, 7, 2, 20, 35);
 * i=0,j=5
 * $brr = array(20, 3, 6, 7, 2, 14, 35);
 * i=0,j=6
 * $brr = array(35, 3, 6, 7, 2, 14, 20);    最大的数字冒到了最上面。
 * 
 * i=1,j=2 以此类推
 */


echo "<br />最后结果<br />";
print_r($brr);


echo "<br />-----------冒泡排序-1--------------------<br />";
// 方法：前后两数进行比较交换，每轮交换，最后一个数为最大值。


function bubbleSort($numbers) {
    $cnt = count($numbers);  // cnt = 10
    // 第一次:i=0;i<9
    for ($i = 0; $i < $cnt-1; $i++) {    // 注意：最大下标为9；i最大值8    ，多了一次  $i<$cnt-1 是正确的。  和下面的排序方法一样。

        // 第一次：i=0;  j=0;j<9;     // 也就是遍历所有的数字  每次减去一个数。  最后 10-8
        for ($j = 0; $j < $cnt - $i - 1; $j++) {   
            

            // 交换：经过一次循环交换，最大的数字冒到了最后。
            if ($numbers[$j] > $numbers[$j + 1]) {
                $temp = $numbers[$j];
                $numbers[$j] = $numbers[$j + 1];
                $numbers[$j + 1] = $temp;
            }
            // 显示推演过程
            //print_r($numbers);echo "<br />";
            
        }
    }
 
    return $numbers;
}

$num = array(20, 40, 60, 80, 30, 70, 90, 10, 50, 0);
print_r($num);echo "<hr />";
print_r(bubbleSort($num));	








echo "<br />------------------冒泡排序2---正序--冒大泡-------------------<br />";
echo "<br />";
$brr = array(49,17,52,22,9,36); // 6个数
$tmp = 0;
for($m = 1; $m < count($brr);$m++){            //一共要比较几轮 5轮，。 为什么是5轮，因为2个数的时候，需要比较。每次去掉一个数。6，5，4，3，2 合计5次

    for($n = 0; $n < (count($brr)-$m);$n++){   //比较一次要比较几个数。每轮都是从第一个数开始往后比较。直到不需要比较的书为止

        
        if($brr[$n]>$brr[$n+1]){               //如果第一个数比第二个数大

            $tmp = $brr[$n];                   //则交换两个数的位置   第一次循环交换到了
            $brr[$n] = $brr[$n+1];
            $brr[$n+1] = $tmp;
        }
        //echo ($arr[$j])."<br />";
    }
}
print_r($brr);
echo "<br />";




/* 

原理：从第一个数开始 往后依次比较。大数往后放，或者小数往后放。比较到最后一个数后。排在最后面的数，就是最大数，或者最小数。

    再从第一个数开始 依次往后比较，交换方法同上，比较到倒数第二个数为止。 

推演过程：

开始：$brr = array(49,17,52,22,9,36);
$m=1,$m<6   $n=0,$n<5
17，49，52，22，9，26
$m=1,$m<6   $n=1,$n<5
17，49，52，22，9，26
$m=1,$m<6   $n=2,$n<5
17，49，22，52，9，26
$m=1,$m<6   $n=3,$n<5
17，49，22，9，52，26
$m=1,$m<6   $n=4,$n<5
17,49,22,9,26,52


$m=2,$m<6   $n=0,$n<4
17,49,22,9,26,52
$m=2,$m<6   $n=1,$n<4
17,22,49,9,26,52
$m=2,$m<6   $n=2,$n<4
17,22,9,49,26,52
$m=2,$m<6   $n=3,$n<4
17,22,9,26,49,52

*/



echo "<br />-----------------------选择排序-----------------------------------<br />";
echo "<br />";
$frr=array(12,6,50,23,38,75);
$tm=0;

for($a=0;$a < count($frr);$a++){    //一共要比较几次

    $minval = $frr[$a];        //假设第一个数为最小数
    $minindex = $a;            //记录最小数的下标

    for($b = $a+1;$b < count($frr);$b++){    //比较一次要比较几个数

        if($minval > $frr[$b]){       //如果最小数比后边一个数大
            $minval = $frr[$b];       //将后边一个数假设成最小数
            $minindex = $b;           //记录最小数的下标
            $tm = $frr[$a];          // 将前边一个数与最小数交换位置
            $frr[$a] = $frr[$minindex];
            $frr[$minindex] = $tm;
        }
        foreach ($frr as $v) {
            echo $v.",";
        }
        echo "<br />";
    }
}
print_r($frr);